Revit 2025 API
FolderItemInfo.ElementId Property
 The folder parameter Id
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public ElementId ElementId { get; }
Public ReadOnly Property ElementId As ElementId
	Get
public:
property ElementId^ ElementId {
	ElementId^ get ();
}
member ElementId : ElementId with get
Property Value
ElementId
See Also
Reference
FolderItemInfo Class
Autodesk.Revit.DB Namespace